Documents/ДвижениеДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДвижениеДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Биржа</xr:Item>
				<xr:Item>AccumulationRegister._ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.НезакрытыеДокументы</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоИнвойсам</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.Зарплата</xr:Item>
				<xr:Item>AccumulationRegister.Деньги</xr:Item>
				<xr:Item>AccumulationRegister.Подотчет</xr:Item>
				<xr:Item>AccumulationRegister.ВКД_ПоступлениеСписаниеДС</xr:Item>
				<xr:Item>AccumulationRegister.ПартииВалюты</xr:Item>
				<xr:Item>AccumulationRegister.Инвестиции</xr:Item>
				<xr:Item>AccumulationRegister.Долги</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязано</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПривязаноИнвойсов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриходРасход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПриходРасход</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенег</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДвиженияДенег</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцЗП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДВалюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДКурс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДОбратный</Name>
					<Comment>Обратный расчет (от конечной суммы)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубДСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаКР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРасчетов</Name>
					<Type>
						<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсПартии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентИнвестиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Затрата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РассчитыватьСреднийКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Привязки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта1</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КроссКурс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Док2</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбратныйКурс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПредоплата</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Инвойсы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инвойс</Name>
							<Type>
								<v8:Type>cfg:DocumentRef._Инвойс</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>сумма в валюте инвойса</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОплаты</Name>
							<Comment>Сумма оплаты (в валюте текущего документа)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаКР</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеПересчитыватьПриходТовара</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Деньги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Деньги</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДенежныеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ДвижениеДенег/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	ИмяДокумента = "ДвижениеДенег";
	Документы[ИмяДокумента].ЗаполнитьРеквизиты(ЭтаФорма);
	гоФормаСпискаПриСоздании(ЭтаФорма);
	
	//2015.11.24
	глПокраситьВалюты(ЭтаФорма, "Валюта");
	глПокраситьСостояние(ЭтаФорма, ИмяДокумента);
	
	//2017.03.22
	Мас = ОбщегоНазначенияПовтИсп.МассивДоступныхКасс(); 
	Если Мас.Количество()  = 1 Тогда
		ФильтрДСчет = Мас[0];	
	ИначеЕсли Мас.Количество() > 0 Тогда 
		гоСтандартныйОтбор(Список, 2, Истина, Мас);
		СпиКас.ЗагрузитьЗначения(Мас);
	КонецЕсли;  
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВсеПараметры()
	//Документы[ИмяДокумента].УстановитьВсеПараметры(ЭтаФорма);
	УстановитьФирму();
	УстановитьКассу();
КонецПроцедуры

&НаСервере
Процедура УстановитьФирму(Принудительно = 0)
	Фильтр = гоФирма();
	Если НЕ (Принудительно = 0) Тогда Фильтр = Принудительно КонецЕсли; 
	
	гоСтандартныйОтбор(Список, 0, Истина, Фильтр);
КонецПроцедуры

&НаСервере
Процедура УстановитьКассу(Принудительно = 0)
	Если НЕ (Принудительно = 0) Тогда ФильтрДСчет = Принудительно КонецЕсли; 
	
	гоСтандартныйОтбор(Список, 1, ЗначениеЗаполнено(ФильтрДСчет), ФильтрДСчет);
	
	ПараметрыСеанса.ДСчет = ФильтрДСчет;
	
	//2017.03.22
	Если СпиКас.Количество() <> 0 Тогда
		Если СпиКас.НайтиПоЗначению(ФильтрДСчет) = Неопределено Тогда ОстаткиПоСчету = "?"; Возврат; КонецЕсли; КонецЕсли;
	
	СтруктураОстатков = СтруктураОстатков(ФильтрДСчет); 
	ОстаткиПоСчету = СтруктураОстатков.Строка; 
	Элементы.ДекорацияОстаткиПоСчету.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураОстатков.ФмтСтрока)); 
	Элементы.ОтчетПартииВалюты.Видимость = ФильтрДСчет.ВестиПартионныйУчет;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	гоЗаголовокИнтервал(ЭтаФорма, Ложь, Истина);
	УстановитьВсеПараметры();
	гоЖурналПриОткрытии(ЭтаФорма, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	гоЖурналПередЗакрытием(ЭтаФорма, Отказ, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ФильтрДСчетПриИзменении(Элемент)

	УстановитьКассу(); 
	гоЗаголовокИнтервал(ЭтаФорма, Ложь, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОстатки(Команда)
	
	Если СпиКас.Количество() <> 0 И СпиКас.НайтиПоЗначению(ФильтрДСчет) = Неопределено Тогда 
		ОстаткиПоСчету = "?";
		Элементы.ДекорацияОстаткиПоСчету.Заголовок = "?";
	Иначе		
		СтруктураОстатков = СтруктураОстатков(ФильтрДСчет); 
		ОстаткиПоСчету = СтруктураОстатков.Строка;
		Элементы.ДекорацияОстаткиПоСчету.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураОстатков.ФмтСтрока)); 
	КонецЕсли;  
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураОстатков(Касса) 
	
	Если гоПЗ(Касса) Тогда 
		Результат = "?"; 
		ФмтРезультат = "?"; 
	Иначе	
		Результат = ""; 
		ФмтРезультат = ""; 
		Фильтр = Новый Структура("Фирма,Касса", Касса.Владелец, Касса);
		Табл = РегистрыНакопления.Деньги.Остатки(, Фильтр, "Валюта", "Остаток");
		Если Табл.Количество() > 0 Тогда 
			Для Каждого стрТабл Из Табл Цикл  
				Граница = Последовательности.ПартииВалют.ПолучитьГраницу(Новый Структура("Касса,Валюта", Касса, стрТабл.Валюта));		
				Если ЗначениеЗаполнено(Граница) Тогда
					СтрГраница = " (" + Граница.Дата + ")";
				Иначе	
					СтрГраница = "";
				КонецЕсли;
				гоРезСоо(Результат, гоСуммаЗнВал(стрТабл.Остаток, стрТабл.Валюта, 2) + СтрГраница, ",   ");  
				ФмтРезультат = СтрШаблон("%1%2 %3%4",
							?(ЗначениеЗаполнено(ФмтРезультат), ФмтРезультат + ",&#160;", ФмтРезультат),
							омСервер.Фрмт(стрТабл.Остаток, "ЧИСЛО_ЦВ2"), 
							омСервер.Фрмт(стрТабл.Валюта, "НАДПИСЬ_ЦВ2"),
							омСервер.Фрмт(?(ЗначениеЗаполнено(Граница), СтрШаблон(" (%1)", Формат(Граница.Дата,"ДЛФ=D")) ,""), "НАДПИСЬ_ЦВ1")
							);

			КонецЦикла; 
		КонецЕсли;  
	КонецЕсли; 
	
	Возврат Новый Структура("Строка,ФмтСтрока", Результат, ФмтРезультат);    
	
КонецФункции


#Область ОтчетПартииВалют

&НаКлиенте
Процедура ОтчетПартииВалюты(Команда)

	// 1. Указываем имя отчета 
    ИмяОтчета = "Отчет.ПартииВалют";
    
    // 2. Получаем схему компоновки данных отчета (чтобы знать структуру настроек)
    // Делаем это через серверный вызов, так как Схема доступна только на сервере
    НастройкиСКД = ПолучитьНастройкиПоУмолчанию(ИмяОтчета);
    
    // 3. Формируем пользовательские настройки (именно они видны на форме отчета)
    ПользовательскиеНастройки = НастройкиСКД.ПользовательскиеНастройки;
    
 	// --- ЗАПОЛНЯЕМ ПАРАМЕТРЫ (Даты, Периоды, Флажки из запроса) ---
    УстановитьЗначениеПараметраСКД(НастройкиСКД.Настройки, ПользовательскиеНастройки, "Валюта", Элементы.Список.ТекущиеДанные.Валюта);
    УстановитьЗначениеПараметраСКД(НастройкиСКД.Настройки, ПользовательскиеНастройки, "Касса", ФильтрДСчет);
	
	//// 4. Устанавливаем нужный отбор (например, по Контрагенту)
	//// ИмяПоля должно точно совпадать с именем поля в запросе СКД
	//УстановитьЗначениеОтбора(НастройкиСКД.Настройки, ПользовательскиеНастройки, "Валюта", Элементы.Список.ТекущиеДанные.Валюта);
	//УстановитьЗначениеОтбора(НастройкиСКД.Настройки, ПользовательскиеНастройки, "Касса", ФильтрДСчет);
    
    // 5. Упаковываем настройки в параметры открытия формы
    ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
    
    // ВАЖНО: Ключ 'СформироватьПриОткрытии' дает команду платформе 
    // не просто открыть форму, но и сразу нажать кнопку "Сформировать"
    ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина);
    
    // 6. Открываем форму отчета
    ОткрытьФорму(ИмяОтчета + ".Форма", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНастройкиПоУмолчанию(ИмяОтчета)
    
    // Создаем "пустой" отчет, чтобы вытащить из него схему
    ОтчетОбъект = Отчеты[СтрЗаменить(ИмяОтчета, "Отчет.", "")].Создать();
    
    Результат = Новый Структура;
    Результат.Вставить("Настройки", ОтчетОбъект.КомпоновщикНастроек.Настройки);
    Результат.Вставить("ПользовательскиеНастройки", ОтчетОбъект.КомпоновщикНастроек.ПользовательскиеНастройки);
    
    Возврат Результат;
    
КонецФункции

&НаСервереБезКонтекста
Процедура УстановитьЗначениеОтбора(Настройки, ПользовательскиеНастройки, ИмяПоля, Значение)
    
    ПолеКомпоновки = Новый ПолеКомпоновкиДанных(ИмяПоля);
    
    // 1. Ищем этот отбор в ОСНОВНЫХ настройках отчета
    // (он там должен быть добавлен разработчиком, пусть даже с пустой галкой)
    ЭлементОтбора = Неопределено;
    Для Каждого Элемент Из Настройки.Отбор.Элементы Цикл
        Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") 
           И Элемент.ЛевоеЗначение = ПолеКомпоновки Тогда
            ЭлементОтбора = Элемент;
            Прервать;
        КонецЕсли;
    КонецЦикла;
    
    Если ЭлементОтбора = Неопределено Тогда
        // Если отбора нет вообще, создаем его (но он не появится в "быстрых", 
        // если не был заранее выведен туда в конфигураторе)
        ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
        ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновки;
    КонецЕсли;
    
    // 2. Ищем СВЯЗАННЫЙ отбор в ПОЛЬЗОВАТЕЛЬСКИХ настройках (те, что на форме)
    // Связь идет по уникальному идентификатору (ИдентификаторПользовательскойНастройки)
    Идентификатор = ЭлементОтбора.ИдентификаторПользовательскойНастройки;
    
    ЭлементПользовательский = ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
    
    Если ЭлементПользовательский <> Неопределено Тогда
        // Если отбор выведен в шапку (быстрые отборы), заполняем его там
        ЭлементПользовательский.ПравоеЗначение = Значение;
        ЭлементПользовательский.Использование  = Истина;
        ЭлементПользовательский.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    Иначе
        // Если отбор скрыт глубоко в настройках
        ЭлементОтбора.ПравоеЗначение = Значение;
        ЭлементОтбора.Использование  = Истина;
        ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
    КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеПараметраСКД(Настройки, ПользовательскиеНастройки, ИмяПараметра, Значение)
    
    // Создаем специальный объект для поиска параметра
    ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных(ИмяПараметра);
    
    // 1. Ищем параметр в ОСНОВНЫХ настройках отчета
    ЭлементПараметра = Настройки.ПараметрыДанных.Элементы.Найти(ПараметрКомпоновки);
    
    Если ЭлементПараметра = Неопределено Тогда
        // Такого параметра нет в схеме вообще
        Возврат; 
    КонецЕсли;
    
    // 2. Ищем связанный параметр в ПОЛЬЗОВАТЕЛЬСКИХ настройках (на форме)
    Идентификатор = ЭлементПараметра.ИдентификаторПользовательскойНастройки;
    
    ЭлементПользовательский = ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
    
    Если ЭлементПользовательский <> Неопределено Тогда
        // Заполняем на форме (в быстрых настройках)
        ЭлементПользовательский.Значение = Значение;
        ЭлементПользовательский.Использование = Истина;
    Иначе
        // Если параметр не выведен пользователю, заполняем его скрыто
        ЭлементПараметра.Значение = Значение;
        ЭлементПараметра.Использование = Истина;
    КонецЕсли;

КонецПроцедуры

#КонецОбласти
